#!/usr/bin/env python
# encoding: utf-8
"""
pyTOP.exceptions
~~~~~~~~~~~~~~~~~~~

This module contains the set of pyTOP's exceptions.

"""

ERROR_MESSAGES = {

    #系统级错误
    3:'图片上传失败',
    4:'用户调用次数超限',
    5:'会话调用次数超限',
    6:'合作伙伴调用次数超限',
    7:'应用调用次数超限',
    8:'应用调用频率超限',
    9:'HTTP方法被禁止（请用大写的POST或GET）',
    10:'服务不可用',
    11:'开发者权限不足',
    12:'用户权限不足',
    13:'合作伙伴权限不足',
    15:'远程服务出错',
    21:'缺少方法名参数',
    22:'不存在的方法名',
    23:'非法数据格式',
    24:'缺少签名参数',
    25:'非法签名',
    26:'缺少SessionKey参数',
    27:'无效的SessionKey参数',
    28:'缺少AppKey参数',
    29:'非法的AppKe参数',
    30:'缺少时间戳参数',
    31:'非法的时间戳参数',
    32:'缺少版本参数',
    33:'非法的版本参数',
    34:'不支持的版本号',
    40:'缺少必选参数',
    41:'非法的参数',
    42:'请求被禁止',
    43:'参数错误',

    #容器类错误
    100:'授权码已经过期',
    101:'授权码在缓存里不存在，一般是用同样的authcode两次获取sessionkey',
    103:'appkey或者tid（插件ID）参数必须至少传入一个',
    104:'appkey或者tid对应的插件不存在',
    105:'插件的状态不对，不是上线状态或者正式环境下测试状态',
    106:'没权限调用此app，由于插件不是所有用户都默认安装，所以需要用户和插件进行一个订购关系。',
    108:'由于app有绑定昵称，而登陆的昵称不是绑定昵称，所以没权限访问。',
    109:'服务端在生成参数的时候出了问题（一般是tair有问题）',
    110:'服务端在写出参数的时候出了问题',
    111:'服务端在生成参数的时候出了问题（一般是tair有问题）',

    #业务级错误
    501:'语句不可索引',
    502:'数据服务不可用',
    503:'无法解释TBQL语句',
    504:'需要绑定用户昵称',
    505:'缺少参数',
    506:'参数错误',
    507:'参数格式错误',
    508:'获取信息权限不足',
    540:'交易统计服务不可用',
    541:'类目统计服务不可用',
    542:'商品统计服务不可用',
    550:'用户服务不可用',
    551:'商品服务不可用',
    552:'商品图片服务不可用',
    553:'商品更新服务不可用',
    554:'商品删除失败',
    555:'用户没有订购图片服务',
    556:'图片URL错误',
    557:'商品视频服务不可用',
    560:'交易服务不可用',
    561:'交易服务不可用',
    562:'交易不存在',
    563:'非法交易',
    564:'没有权限添加或更新交易备注',
    565:'交易备注超出长度限制',
    566:'交易备注已经存在',
    567:'没有权限添加或更新交易信息',
    568:'交易没有子订单',
    569:'交易关闭错误',
    570:'物流服务不可用',
    571:'非法的邮费',
    572:'非法的物流公司编号',
    580:'评价服务不可用',
    581:'添加评价服务错误',
    582:'获取评价服务错误',
    590:'店铺服务不可用',
    591:'店铺剩余推荐数 服务不可用',
    592:'卖家自定义类目服务不可用',
    594:'卖家自定义类目添加错误',
    595:'卖家自定义类目更新错误',
    596:'用户没有店铺',
    597:'卖家自定义父类目错误',
    601:'用户不存在',
    611:'产品数据格式错误',
    612:'产品ID错误',
    613:'删除产品图片错误',
    614:'没有权限添加产品',
    615:'收货地址服务不可用',
    620:'邮费服务不可用',
    621:'邮费模板类型错误',
    622:'缺少参数：post, express或ems',
    623:'邮费模板参数错误',
    630:'收费服务不可用',
    650:'退款服务不可用',
    651:'非法的退款编号',
    670:'佣金服务不可用',
    671:'佣金交易不存在',
    672:'淘宝客报表服务不可用',
    673:'备案服务不可用',
    674:'应用服务不可用',
    710:'淘宝客服务不可用',
    900:'远程连接错误',
    901:'远程服务超时',
    902:'远程服务错误',
    
    #CUSTOM ERRORS
    1000:'Bad Environment',
}

class TOPException(Exception):
    """There was an ambiguous exception that occurred while handling your
    TOP request."""
    def __init__(self, code, msg=None):
        if not msg:
            msg = ERROR_MESSAGES.get(code,'未知错误(%d)'%code)
        if type(msg) == str:
            msg = msg.encode('utf-8')
        super(TOPException, self).__init__(msg)
        self.code = code
    
    def __str__(self):
        return "%s (code=%d)" % (super(TOPException, self).__str__(), self.code)
    
    __repr__ = __str__
